mongo_metrics/modified_run_b_mongo_threads_002_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloadb -threads 2 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 2606
[OVERALL], Throughput(ops/sec), 383.7298541826554
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.03837298541826554
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 1
[TOTAL_GC_TIME_%], Time(%), 0.03837298541826554
[READ], Operations, 950
[READ], AverageLatency(us), 3835.1631578947367
[READ], MinLatency(us), 156
[READ], MaxLatency(us), 24911
[READ], 95thPercentileLatency(us), 6859
[READ], 99thPercentileLatency(us), 9447
[READ], Return=OK, 950
[SCAN-FAILED], Operations, 32
[SCAN-FAILED], AverageLatency(us), 18252.0
[SCAN-FAILED], MinLatency(us), 13840
[SCAN-FAILED], MaxLatency(us), 26271
[SCAN-FAILED], 95thPercentileLatency(us), 22991
[SCAN-FAILED], 99thPercentileLatency(us), 26271
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 1416.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 2829
[CLEANUP], 95thPercentileLatency(us), 2829
[CLEANUP], 99thPercentileLatency(us), 2829
[SCAN], Operations, 18
[SCAN], AverageLatency(us), 16133.333333333334
[SCAN], MinLatency(us), 13752
[SCAN], MaxLatency(us), 20703
[SCAN], 95thPercentileLatency(us), 19439
[SCAN], 99thPercentileLatency(us), 20703
[SCAN], Return=OK, 18
[SCAN], Return=ERROR, 32