mongo_metrics/modified_run_b_mongo_threads_008_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloadb -threads 8 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 1664
[OVERALL], Throughput(ops/sec), 600.9615384615385
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1201923076923077
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 2
[TOTAL_GC_TIME_%], Time(%), 0.1201923076923077
[READ], Operations, 959
[READ], AverageLatency(us), 8763.152241918666
[READ], MinLatency(us), 170
[READ], MaxLatency(us), 46527
[READ], 95thPercentileLatency(us), 21791
[READ], 99thPercentileLatency(us), 29759
[READ], Return=OK, 959
[SCAN-FAILED], Operations, 26
[SCAN-FAILED], AverageLatency(us), 39826.153846153844
[SCAN-FAILED], MinLatency(us), 14200
[SCAN-FAILED], MaxLatency(us), 72511
[SCAN-FAILED], 95thPercentileLatency(us), 69119
[SCAN-FAILED], 99thPercentileLatency(us), 72511
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 593.875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4747
[CLEANUP], 95thPercentileLatency(us), 4747
[CLEANUP], 99thPercentileLatency(us), 4747
[SCAN], Operations, 15
[SCAN], AverageLatency(us), 45545.066666666666
[SCAN], MinLatency(us), 16656
[SCAN], MaxLatency(us), 81791
[SCAN], 95thPercentileLatency(us), 76863
[SCAN], 99thPercentileLatency(us), 81791
[SCAN], Return=OK, 15
[SCAN], Return=ERROR, 26